//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
//a = 5; b = 7 -> max = 7
//a = 2 b = 10 -> max = 10
//a = -9 b = -3 -> max = -3//

/*
Console.WriteLine("Input a first number ");
int n1 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Input a second number ");
int n2 = Convert.ToInt32(Console.ReadLine());

if(n1 > n2)
{
Console.WriteLine("Largest number is: " + n1 + " smallest number is: " + n2 );
}
else
{
Console.WriteLine("Largest number is: " + n2 + " smallest number is: " + n1 );
}
*/
